src/Documents/ПриходноКассовыйОрдер/ПриходноКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ПриходноКассовыйОрдер</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>Касса</name>
		<type>
			<types>CatalogRef.Касса</types>
		</type>
	</attributes>
	<attributes>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаПлатежа</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>БанковскийСчет</name>
		<type>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОплаты</name>
		<type>
			<types>EnumRef.ВидОплаты</types>
		</type>
	</attributes>
	<attributes>
		<name>ВалютаОплаты</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<tabularSections>
		<name>РасшифровкаПлатежа</name>
		<attributes>
			<name>Билет</name>
			<type>
				<types>CatalogRef.Билет</types>
			</type>
		</attributes>
		<attributes>
			<name>СуммаПлатежа</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаВзаиморасчетов</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>МаскаБилета</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>15</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Поставщик</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>Расшифровка</name>
		<attributes>
			<name>СуммаЗадолженности</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>ЗачетОплаты</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/Enums/ВидОплаты/ВидОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидОплаты</name>
	<enumValues>
		<name>Наличный</name>
	</enumValues>
	<enumValues>
		<name>Безналичный</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ПриходноКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
//&НаКлиенте
//Процедура Заполнить(Команда)
//	ЗаполнитьНаСервере()	
//КонецПроцедуры
//&НаСервере
//Процедура ЗаполнитьНаСервере()
//	ДанныеФормы=РеквизитФормыВЗначение("Объект");
//	Таблица=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(ДанныеФормы.Покупатель,ТекущаяДата(),"МодульФормы");
//	ДанныеФормы.Расшифровка.Загрузить(Таблица);
//	ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//КонецПроцедуры

&НаКлиенте
Процедура ПокупательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сумма=ВозвратСуммы(ВыбранноеЗначение);
	Элементы.Долг.Заголовок="Долг равен: "+Сумма;
КонецПроцедуры
&НаСервере
Функция ВозвратСуммы(Кассир)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");	
	Сумма=ОбщийМодуль.ВозвратОстатковПоЗадолженности(Кассир,ДанныеФормы.Дата);
	Возврат Сумма;	
КонецФункции

//&НаКлиенте
//Процедура СуммаПлатежаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	Оповещение=Новый ОписаниеОповещения("ОбработкаДиалога",ЭтотОбъект);
//	ПоказатьВопрос(Оповещение,"Распеределить по ровну",РежимДиалогаВопрос.ДаНет,0);
//КонецПроцедуры
//&НаКлиенте
//Процедура ОбработкаДиалога(Результат,Параметр)Экспорт
//	Если Результат=КодВозвратаДиалога.Да Тогда
//		ПараметрРаспределения="По ровну";
//		РаспределениеРасчетов(ПараметрРаспределения);
//	Иначе
//		ПараметрРаспределения="На первую строку";
//		РаспределениеРасчетов(ПараметрРаспределения);
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Процедура РаспределениеРасчетов(ПараметрРаспределения)
//	ДанныеФормы=РеквизитФормыВЗначение("Объект");
//	Если ПараметрРаспределения="По ровну" Тогда
//		КоличествоСтрокТаблицы=ДанныеФормы.РасшифровкаПлатежа.Количество();
//		СредняяСумма=ДанныеФормы.СуммаПлатежа/КоличествоСтрокТаблицы;
//		Для каждого СтрТаб из ДанныеФормы.расшифровкаПлатежа Цикл
//			СтрТаб.СуммаПлатежа=СредняяСумма;	
//		КонецЦикла;
//		ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//	ИначеЕсли ПараметрРаспределения="На первую строку" Тогда
//		Для каждого СтрТаб из ДанныеФормы.РасшифровкаПлатежа Цикл
//			СтрТаб.СуммаПлатежа=ДанныеФормы.СуммаПлатежа;
//			Прервать;
//		КонецЦикла;
//		ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//	КонецЕсли;
//КонецПроцедуры
&НаСервере
Функция ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Данные="";
	Если ВыбранноеЗначение=Перечисления.ВидОплаты.Наличный Тогда
		Данные="Наличный";
	ИначеЕсли ВыбранноеЗначение=Перечисления.ВидОплаты.Безналичный Тогда
		Данные="Безналичный";
	КонецЕсли;
	Возврат Данные;
КонецФункции
&НаКлиенте
Процедура ВидОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Данные=ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Если Данные="Наличный" Тогда
		Элементы.Касса.ТолькоПросмотр=Ложь;
		Элементы.БанковскийСчет.ТолькоПросмотр=Истина;
	ИначеЕсли Данные="Безналичный" Тогда
		Элементы.Касса.Доступность=Истина;
		Элементы.БанковскийСчет.ТолькоПросмотр=Ложь;	
	КонецЕсли;
КонецПроцедуры
